run/mShock_oneStepGlobal_1D/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform  1e5; //1.33e4;

boundaryField
{
    left
    {
        type            zeroGradient;
    }

    right
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        1e5;
        lInf            1e3;
    }

    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
